*** The sizeof operator
You can use the =sizeof= operator to get the size of a data type or variable in bytes:

#+begin_src C
	#include <stdio.h>

	int main(void)
	{
		int x = 22;

		// "sizeof(x)" is equal to "sizeof(int)" because x
		// is an int
		// You could also write "sizeof x" or "sizeof int"
		unsigned long size_of_x = sizeof(x);

		// When parentheses are used, sizeof looks like
		// a function, but it is not one. sizeof is
		// built into the compiler.

		// Print out size_of_x
		printf("x is %lu bytes long.\n", size_of_x);
		return 0;
	}
#+end_src

#+RESULTS:
: x is 4 bytes long.

If you don't know how to print variables, see [[printing_variables][here]].

